{
  "backend/main.mo": "Motoko canister defining recipe data models, in-memory storage, and public APIs to add, fetch, and filter bilingual recipes by cuisine or category, with initial seeding on upgrade.",
  "feature_evidence.json": "Machine-readable report mapping implemented product features to frontend files, components, test requirements, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all frontend source files, used as documentation or planning reference.",
  "frontend/index.css": "Global Tailwind CSS base styles and OKLCH color tokens defining the food-themed design system for light and dark modes.",
  "frontend/index.html": "HTML entry point that mounts the React application and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Root React application configuring TanStack Router routes, global layout with header/footer, language provider, and toast notifications.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, Explore and New Recipe actions, and a global Hindi/English language toggle.",
  "frontend/src/components/PhotoAssetPicker.tsx": "Form component that lets users select a recipe image from predefined static photo assets using a radio grid.",
  "frontend/src/components/RecipeCard.tsx": "Clickable card component displaying a recipe’s image, localized title/description, category, cuisine, and key metadata.",
  "frontend/src/components/RecipeFiltersBar.tsx": "Search and filter bar with text search and category/cuisine dropdowns for narrowing the recipe list.",
  "frontend/src/components/RecipeForm.tsx": "React form component for creating a recipe with bilingual (English/Hindi) fields, metadata inputs, category/cuisine selectors, and photo asset selection, managing local form state and submission.",
  "frontend/src/components/RecipeMetadata.tsx": "Displays recipe metadata such as category, cuisine, prep/cook time, and servings, with card and detail variants using badges, icons, and localized labels.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on the current Internet Identity, using React Query and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login/logout, persisted identity loading, login status flags, and integration with Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching, searching, and mutating recipes via the backend actor, including get-all, get-by-id, add-recipe, and client-side search.",
  "frontend/src/i18n/LanguageProvider.tsx": "Context provider for application language state (English/Hindi), exposing a toggle function and a translation helper based on string keys.",
  "frontend/src/i18n/strings.ts": "Centralized dictionary of English and Hindi translations for UI labels, categories, cuisines, and common application text.",
  "frontend/src/index.css": "Tailwind CSS setup defining design tokens, color themes, light/dark mode variables, and base typography styles for the application.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app and wraps it with React Query and Internet Identity providers, and imports global styles.",
  "frontend/src/pages/ExplorePage.tsx": "Implements the main explore page that fetches and displays all recipes in a responsive grid with a hero section, search, and category/cuisine filters, supporting bilingual text. Handles loading states with skeletons and empty results messaging.",
  "frontend/src/pages/NewRecipePage.tsx": "Provides a page for creating a new recipe using a form, submitting bilingual recipe data and metadata via a mutation hook. Shows success/error toasts and navigates back to the explore page after completion or cancel.",
  "frontend/src/pages/RecipeDetailPage.tsx": "Displays detailed information for a single recipe, including image, bilingual title/description, metadata, ingredients, and step-by-step instructions. Handles loading and missing-recipe states and allows navigation back to explore.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode support, content paths, custom container settings, extended color tokens driven by CSS variables, typography, animations, and UI-focused plugins.",
  "project_state.json": "Stores high-level project metadata, including schema/version info, a summary of the Yammy Nevliya recipe website, implemented features, and pending feature requests with requirement references."
}